package Day08_hw;

public class hw08_1 {
	
	//itdanja@kakao.com
	//과제1 : 회원제 게시판
//			1. 회원 클래스 => 객체 => 회원목록 리스트
//				회원 필드 : 아이디, 비밀번호, 이름, 연락처
//				회원 생성자 : 선택
//				회원 메소드 : 회원가입, 로그인, 회원탁ㄹ퇴, 회원수정
//			2. 게시판 클래스 => 객체 => 게시물목록 리스트
//				게시판 필드 : 제목, 내용, 작성자[로그인된아이디], 작성일, 조회수
//				게시판 생성자 : 선택
//				게시판 메소드 : 글쓰기, 글출력, 글상세보기 , 글삭제, 글수정
//			3. 프로그램 클래스 [main 메소드]
//					1. 메뉴 생성
//						1. 회원가입 [아이디 중복제거]
//						2. 로그인
//						3. 종료
//					2. 로그인 성공시 메뉴	
//						- 모든 게시물의 커뮤니티 출력
//						1. 회원목록
//						2. 글쓰기
//						3. 글보기
//					3. 글보기 했을때
//						1. 로그인한 아이디와 글 작성자와 동일한 경우에만 글삭제, 글수정


}
